import axios from 'axios';
export default async function getImagesByQuery(query, page = 1) {
  axios.defaults.baseURL = 'https://pixabay.com';
  const details = await axios.get('/api/', {
    params: {
      key: '51453441-8ba936d16adf232cd1ca4d1fd',
      q: query,
      image_type: 'photo',
      orientation: 'horizontal',
      page: page,
      per_page: 15,
      safesearch: true,
    },
  });

  return details.data;
}

/*
У файлі pixabay-api.js зберігай функції для виконання HTTP-запитів:

getImagesByQuery(query, page). Ця функція повинна приймати два параметри query (пошукове слово, яке є рядком) та page (номер сторінки, яка є числом), здійснювати HTTP-запит і повертати значення властивості data з отриманої відповіді.



Використовуй код із домашньої роботи попереднього модуля та застосуй синтаксис async/await для роботи з асинхронними запитами. Виконай рефакторинг свого коду.



Пагінація



Pixabay API підтримує пагінацію та надає параметри page і per_page. Зроби так, щоб у кожній відповіді при пошуку зображень приходило 15 об'єктів (за замовчуванням 20).

Початкове значення параметра page повинно бути 1.
З кожним наступним запитом його необхідно збільшити на 1.
У разі пошуку за новим ключовим словом значення page потрібно повернути до початкового, оскільки буде пагінація для нової колекції зображень.


Додай в HTML-документі після галереї розмітку кнопки з текстом Load more, за кліком на яку необхідно виконувати запит за наступною групою зображень і додавати розмітку до вже існуючих елементів галереї. Для цього при сабміті форми тобі необхідно зберігати те, що ввів користувач у глобальну змінну.



Поки в галерії нема зображень, кнопка повинна бути прихована.
Після того як у галереї з'являються зображення, кнопка з'являється в інтерфейсі під галереєю.
При повторному сабміті форми кнопка спочатку ховається, а після отримання результатів запиту знову відображається за потреби.
Перенеси індикатор завантаження під кнопку завантаження додаткових зображень.



Використовуй код із домашньої роботи попереднього модуля та доповни код застосунку пошуку зображень новим функціоналом.

Пагінація



Pixabay API підтримує пагінацію та надає параметри page і per_page. Зроби так, щоб у кожній відповіді при пошуку зображень приходило 15 об'єктів (за замовчуванням 20).

Початкове значення параметра page повинно бути 1.
З кожним наступним запитом його необхідно збільшити на 1.
У разі пошуку за новим ключовим словом значення page потрібно повернути до початкового, оскільки буде пагінація для нової колекції зображень.



*/
